app/Controllers/Pengawas.php

    public function index()
    {
        $session = session();

        // Dapatkan data dari sesi
        $data_fakultas = $session->get('fakultas');

        // dd($data_fakultas);
        $staffModel = new StaffModel();

        // Konfigurasi Paginasi
        $pager = \Config\Services::pager();
        $pager->setPath(''); // Menyembunyikan URL paginasi

        $data['staf'] = $staffModel->where('unit_kode_fakultas', $data_fakultas)
                            ->orderBy('kode', 'DESC')->findAll();
---
SELECT *
FROM `staf`
WHERE `unit_kode_fakultas` = 'F'
ORDER BY `kode` DESC