app/Models/M_user.php

SELECT *
FROM `user`
WHERE `username` = 'admin12'
AND `password` = 'admin123'
---
    public function getUser($username, $password)
    {
        return $this->db->table($this->table)
                        ->where('username', $username)
                        ->where('password', $password)
                        ->get()->getRowArray();